
#include <arpa/inet.h>  //funciones usadas para internet
#include <errno.h>
#include <fcntl.h>  //constantes tipo O_*
#include <net/if.h>
#include <net/if_arp.h>
#include <net/route.h>
#include <netdb.h>
#include <netinet/in.h>
#include <resolv.h>  //resolutores
#include <signal.h>  //señales
#include <stdarg.h>  //Manejar argumentos del tipo " ... "
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/ioctl.h>
#include <sys/socket.h>  //socket
#include <sys/stat.h>    //información sobre atributos de archivos
#include <sys/time.h>    //funciones de tiempo
#include <sys/types.h>   //tipos de dato *_t para el sistema operativo
#include <sys/utsname.h>
#include <sys/wait.h>  //
#include <syslog.h>    //log del sistema
#include <time.h>
#include <unistd.h>  //llamadas al sistema
#include "cmdline.h"

#define MAX_BUFSIZE 1500

#define MODE_CONFIG_FILE 0     // Archivo de configuración + línea de comandos
#define MODE_ONLY_CMDLINE 1    // Solo línea de comandos
#define MODE_NET_PARAMETERS 2  // Obtener parámetros de red

// Tipos de mensaje
enum dhcp_msg_type {

    DHCPDISCOVER = 1,
    DHCPOFFER    = 2,
    DHCPREQUEST  = 3,
    DHCPDECLINE  = 4,
    DHCPACK      = 5,
    DHCPNAK      = 6,
    DHCPRELEASE  = 7,
    DHCPINFORM   = 8

};

enum dhcp_mode {

    GET_NETWORK_PARAMETERS = 1,
    CMDLINE                = 2,
    CONF_CMDLINE           = 3
};
enum dhcp_lease_state {
    S_FREE     = 0,
    S_LEASED   = 1,
    S_RESERVED = 2,
    S_PROHIBIT = 3,
    S_EXPIRED  = 4,
    S_WAIT     = 5,
    S_OWN      = 6
};

typedef struct dhcp_lease {
    enum dhcp_lease_state state;
    struct in_addr        ip;
    struct in_addr        broadcast;
    struct in_addr        netmask;
    struct in_addr        gateway;
    struct in_addr        dns1;
    struct in_addr        dns2;
    time_t                renewal;
    time_t                rebinding;
    time_t                lease_time;
    struct timespec       elapsed;
    struct timespec       start;
    struct timespec       now;
    u_char                mac[6];
    char                  hostname[255];
    // int                   max_msg_size;
    u_int32_t          xid;
    struct dhcp_lease *next;

} dhcp_lease;

typedef struct dhcp_options {

    struct in_addr     requested_address;        // 50
    char *             hostname;                 // 12
    bool               overload;                 // 52
    char *             tftp_sv_name;             // 66
    char *             boot_filename;            // 67
    enum dhcp_msg_type type;                     // 53
    struct in_addr     sv_identifier;            // 54
    char *             msg_err;                  // 56
    u_int16_t          max_message_size;         // 57
    char *             vendor_class_identifier;  // 60
    u_char *           client_identifier;        // 61
    //
    struct in_addr netmask;  // 1
    struct in_addr router;   // 3
    struct in_addr dns1;     // 6
    struct in_addr dns2;
    char *         dns_domain_name;  // 15
    struct in_addr broadcast;        // 28
    struct in_addr static_route;     // 33, ignorada
    time_t         lease_time;       // 51
    time_t         renewal;          // 58
    time_t         rebinding;        // 59

} dhcp_options;

typedef struct dhcp_msg {

    u_int8_t  op;
    u_int8_t  htype;
    u_int8_t  hlen;
    u_int8_t  hops;
    u_int32_t xid;
    u_int16_t secs;
    u_int16_t flags;

    struct in_addr ciaddr;
    struct in_addr yiaddr;
    struct in_addr siaddr;
    struct in_addr giaddr;

    u_char              chaddr[6];
    u_char              sname[64];  //  DHCP Option Overload option
    u_char              file[128];  // DHCP Option Overload option.
    u_char *            options_requested;
    size_t              len_requested;
    struct dhcp_options options;

} dhcp_msg;

typedef struct net_config {

    struct in_addr     ip;
    struct in_addr     dns1;
    struct in_addr     dns2;
    struct in_addr     broadcast;
    struct in_addr     netmask;
    struct in_addr     gateway;
    struct sockaddr_in resolver;
    struct in_addr     initial_ip;
    struct in_addr     last_ip;
    char               config_file[255];
